{
    "films": [
      {
        "id": 1,
        "title": "Game of Thrones",
        "runtime": "1000min",
        "capacity": 3,
        "showtime": "8:00 PM",
        "tickets_sold": 0,
        "description": "Nine noble families wage war against each other in order to gain control over the mythical land of Westeros. Meanwhile, a force is rising after millenniums and threatens the existence of living men.",
        "poster": "img1.jpg"
      },
      {
        "id": 2,
        "title": "Teen Wolf",
        "runtime": "188min",
        "capacity": 10,
        "showtime": "8:00 PM",
        "tickets_sold": 0,
        "description": "Scott McCall, an awkward teen, turns into a werewolf after being bitten by one a day before sophomore year. He must learn to adapt to his new identity while handling life as a teenager.",
        "poster": "img2.jpg"
      },
      {
        "id": 3,
        "title": "Kong Skull Island",
        "runtime": "145min",
        "capacity": 5,
        "showtime": "8:00 PM",
        "tickets_sold": 0,
        "description": "A crew that reaches Skull Island to map it, is attacked by a humongous ape. The survivors then regroup to find out more about the ape, the island's natives and underground monsters.",
        "poster": "img3.jpg"
      },
      {
        "id": 4,
        "title": "Furiosa",
        "runtime": "155min",
        "capacity": 3,
        "showtime": "8:00 PM",
        "tickets_sold": 0,
        "description": "Snatched from the Green Place of Many Mothers, young Furiosa falls into the hands of a great biker horde led by the warlord Dementus. Sweeping through the Wasteland, they come across the Citadel, presided over by the Immortan Joe. As the two tyrants fight for dominance, Furiosa soon finds herself in a nonstop battle to make her way home.",
        "poster": "img4.jpg"
      },
      {
        "id": 5,
        "title": "Fast and Furious 11",
        "runtime": "132mins",
        "capacity": 14,
        "showtime": "8:00 PM",
        "tickets_sold": 0,
        "description": "Fast & Furious 11, also known as Fast X Part 2, is the eleventh film in the Fast & Furious series, the twelfth film overall, and the concluding film of main Fast & Furious timeline. The film will be directed by Louis Leterrier and released on April 4th, 2025.",
        "poster": "img5.jpg"
      },
      {
        "id": 6,
        "title": "The Boys",
        "runtime": "789mins",
        "capacity": 8,
        "showtime": "8:00 PM",
        "tickets_sold": 0,
        "description": "Superheroes are often as popular as celebrities, as influential as politicians, and sometimes even as revered as gods. But that's when they're using their powers for good. What happens when the heroes go rogue and start abusing their powers?",
        "poster": "img6.jpg"
      },
      {
        "id": 7,
        "title": "House of the Dragon",
        "runtime": "568mins",
        "capacity": 4,
        "showtime": "8:00 PM",
        "tickets_sold": 0,
        "description": "After the death of their father, two siblings fight for the throne, thereby causing a civil war known as the Dance of the Dragons.",
        "poster": "img7.jpg"
      },
      {
        "id": 8,
        "title": "Parasyte: The Grey",
        "runtime": "689mins",
        "capacity": 11,
        "showtime": "8:00 PM",
        "tickets_sold": 0,
        "description": "People must rise to combat unidentified parasites after they violently take over human hosts and gain power.",
        "poster": "img8.jpg"
      },
      {
        "id": 9,
        "title": "Heart of the Hunter",
        "runtime": "129mins",
        "capacity": 10,
        "showtime": "8:00 PM",
        "tickets_sold": 0,
        "description": "The quiet retirement of a once-feared assassin in South Africa is interrupted by a desperate call from the daughter of an old and trusted friend whose father has been kidnapped. He uncovers a conspiracy at the heart of the government.",
        "poster": "img9.jpg"
      },
      {
        "id": 10,
        "title": "The Incredibles",
        "runtime": "118mins",
        "capacity": 6,
        "showtime": "8:00 PM",
        "tickets_sold": 0,
        "description": "Forced to adopt a civilian identity and stuck in a white-collar job, Mr Incredible itches to get back into action. When he is lured into a trap by the evil Syndrome, his family contrives to save him.",
        "poster": "img10.jpg"
      },
      {
        "id": 11,
        "title": "She-hulk",
        "runtime": "456mins",
        "capacity": 10,
        "showtime": "8:00 PM",
        "tickets_sold": 0,
        "description": "Jennifer Walters has a complicated life as a single, 30-something attorney who also happens to be a green 6-foot-7-inch superpowered hulk.",
        "poster": "img11.jpg"
      },
      {
        "id": 12,
        "title": "Dawn of the planets of the apes",
        "runtime": "201mins",
        "capacity": 5,
        "showtime": "8:00 PM",
        "tickets_sold": 0,
        "description": "Caesar, a chimpanzee and leader of the evolved apes, allows a human family into his territory. However, due to a vindictive bonobo, misunderstandings arise between the two species, resulting in war.",
        "poster": "img12.jpg"
      }
    ]
  }
  